Press RETURN to get started.













Router1>enable
Password: 
Router1#show run
Building configuration...

Current configuration : 644 bytes
!
version 15.4
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname Router1
!
!
!
enable secret 5 $1$mERr$5.a6P4JqbNiMX01usIfka/
enable password 7 0822455D0A16
!
!
!
!
!
!
no ip cef
no ipv6 cef

Router1#logout









Router1 con0 is now available






Press RETURN to get started.













Router1>enable
Password: 
Router1#enable
Router1#con t
% Ambiguous command: "con t"
Router1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)#show ip interface brief
                 ^
% Invalid input detected at '^' marker.
	
Router1(config)#show ip int brief
                 ^
% Invalid input detected at '^' marker.
	
Router1(config)#configure terminal
                      ^
% Invalid input detected at '^' marker.
	
Router1(config)#end
Router1#
%SYS-5-CONFIG_I: Configured from console by console

Router1#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router1#conf ter
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)#interface gigbitEthernet 0/0/0
                             ^
% Invalid input detected at '^' marker.
	
Router1(config)#interface gigabitEthernet 0/0/0
Router1(config-if)#no shutdown

Router1(config-if)#
%LINK-5-CHANGED: Interface GigabitEthernet0/0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0/0, changed state to up

Router1(config-if)#end
Router1#
%SYS-5-CONFIG_I: Configured from console by console

Router1#show ip interface brief
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0/0   unassigned      YES unset  up                    up 
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down 
Vlan1                  unassigned      YES unset  administratively down down
Router1#ip address ?
% Unrecognized command
Router1#ip address 
           ^
% Invalid input detected at '^' marker.
	
Router1#ip 
Translating "ip"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address

Router1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)#ip address
                    ^
% Invalid input detected at '^' marker.
	
Router1(config)#ip address ?
% Unrecognized command
Router1(config)#interface gigabitEthernet 0/0/0
Router1(config-if)#ip address ?
  A.B.C.D  IP address
  dhcp     IP Address negotiated via DHCP
Router1(config-if)#ip address 10.1.1.1 ?
  A.B.C.D  IP subnet mask
Router1(config-if)#ip address 10.1.1.1 255.255.255.0
Router1(config-if)#end
Router1#
%SYS-5-CONFIG_I: Configured from console by console

Router1#show ip interface gigabit
Router1#show ip interface gigabitEthernet 0/0/0
GigabitEthernet0/0/0 is up, line protocol is up (connected)
  Internet address is 10.1.1.1/24
  Broadcast address is 255.255.255.255
  Address determined by setup command
  MTU is 1500 bytes
  Helper address is not set
  Directed broadcast forwarding is disabled
  Outgoing access list is not set
  Inbound  access list is not set
  Proxy ARP is enabled
  Security level is default
  Split horizon is enabled
  ICMP redirects are always sent
  ICMP unreachables are always sent
  ICMP mask replies are never sent
  IP fast switching is disabled
  IP fast switching on the same interface is disabled
  IP Flow switching is disabled
  IP Fast switching turbo vector
  IP multicast fast switching is disabled
  IP multicast distributed fast switching is disabled
  Router Discovery is disabled
  IP output packet accounting is disabled

Router1#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.1                -   0030.F2C1.8001  ARPA   GigabitEthernet0/0/0
Router1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router1(config)#host Router0
Router0(config)#end
Router0#
%SYS-5-CONFIG_I: Configured from console by console

Router0#ping 10.1.1.2

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.1.1.2, timeout is 2 seconds:
.!!!!
Success rate is 80 percent (4/5), round-trip min/avg/max = 0/7/28 ms

Router0#show arp
Protocol  Address          Age (min)  Hardware Addr   Type   Interface
Internet  10.1.1.1                -   0030.F2C1.8001  ARPA   GigabitEthernet0/0/0
Internet  10.1.1.2                0   00E0.F970.5701  ARPA   GigabitEthernet0/0/0
Router0#end
Translating "end"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
